ch32-rs/ch32-rs/svd/fixed/ch32l103.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EXTEN</name>
      <description> Exten configuration</description>
      <groupName>EXTEN</groupName>
      <baseAddress>0x40023800</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
	    <registers>
        <register>
          <name>EXTEN_CTR</name>
          <displayName>CTR</displayName>
          <description>EXTEN  control register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000A00</resetValue>
          <fields> 
            <field>
              <name>HSIPRE</name>
              <description>Whether HSI is divided </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LKUPEN</name>
              <description>LOCKUP_Eable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
            <field>
              <name>LKUPRST</name>
              <description>LOCKUP RESET</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>    
            <field>
              <name>ULLDOTRIM</name>
              <description>ULLDOTRIM</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>  
            <field>
              <name>LDOTRIM</name>
              <description>LDOTRIM</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>   
          </fields>
        </register>
	    </registers>
    </peripheral>	
	<peripheral>
      <name>OPA</name>
      <description> OPA configuration</description>
      <groupName>OPA</groupName>
      <baseAddress>0x40026000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>OPA</name>
        <description>OPA global interrupts</description>
        <value>64</value>
      </interrupt>
      <registers>
        <register>
          <name>CFGR1</name>
          <displayName>CFGR1</displayName>
          <description>OPA configuration 1</description>
          <addressOffset>0x00</addressOffset>
          <size>0x10</size>
          <resetValue>0x0080</resetValue>
          <fields>
            <field>
              <name>POLL_EN</name>
              <description>OPA1 enable positive polling</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>  
            <field>
              <name>BKIN_EN</name>
              <description>OPA1 break function enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
               <field>
              <name>RST_EN</name>
              <description>OPA1 reset enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POLL_LOCK</name>
              <description>POLL LOCK</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>    
            <field>
              <name>IE_OUT</name>
              <description>OPA1 interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>  
            <field>
              <name>IE_CNT</name>
              <description>OPA interrupt enable at the end of polling interval</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
                 <field>
              <name>NMI_EN</name>
              <description>OPA connection NMI interrupt enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
            <field>
              <name>IF_OUT</name>
              <description>OPA1 output interrupt</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 	
            <field>
              <name>IF_CNT</name>
              <description>OPA interrupt flag at the end of polling interval</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 					
        </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <displayName>CFGR2</displayName>
          <description>OPA configuration 2</description>
          <addressOffset>0x02</addressOffset>
          <size>0x10</size>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>POLL1_NUM</name>
              <description>OPA1 polling the number of positive ends</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POLL_VLU</name>
              <description>OPA1 polling interval</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field> 			
          </fields>
        </register>
        <register>
          <name>CTLR1</name>
          <displayName>CTLR1</displayName>
          <description>OPA control register 1</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <resetValue>0x81D801D8</resetValue>
          <fields>
            <field>
              <name>OPA_LOCK</name>
              <description>OPA lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITRIMN</name>
              <description>OPA1 low-level offset voltage value selection</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTRIMN</name>
              <description>OPA1 low-level offset voltage value polarity selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITRIMP</name>
              <description>OPA1 high-level offset voltage value selection</description>
              <bitOffset>17</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTRIMP</name>
              <description>OPA1 high-level offset voltage value polarity selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP1</name>
              <description>OPA1 low-power mode selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NSEL1</name>
              <description>OPA1 negative end channel selection with PGA gain selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FB_EN1</name>
              <description>OPA1 internal feedback resistance enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSEL1</name>
              <description>OPA1 forward input selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE1</name>
              <description>OPA1 output channel selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN1</name>
              <description>OPA1 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>			
          </fields>
        </register>
        <register>
          <name>CTLR2</name>
          <displayName>CTLR2</displayName>
          <description>OPA control register 2</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>CMP_LOCK</name>
              <description>CMP lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUP_MD</name>
              <description>CMP wake-up signal mode selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP3</name>
              <description>CMP3 low-power switch</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYEN3</name>
              <description>CMP3 hysteresis function selection</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSEL3</name>
              <description>CMP3 forward input selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NSEL3</name>
              <description>CMP3 negative input selection</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE3</name>
              <description>CMP3 Output channel selection</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN3</name>
              <description>CMP3 enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP2</name>
              <description>CMP2 low-power switch</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYEN2</name>
              <description>CMP2 hysteresis function selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSEL2</name>
              <description>CMP2 forward input selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NSE2L</name>
              <description>CMP2 negative input selection</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE2</name>
              <description>CMP2 Output channel selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN2</name>
              <description>CMP2 enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP1</name>
              <description>CMP1 low-power switch</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYEN1</name>
              <description>CMP1 hysteresis function selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSEL1</name>
              <description>CMP1 forward input selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NSEL1</name>
              <description>CMP1 negative input selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE1</name>
              <description>CMP1 Output channel selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN1</name>
              <description>CMP1 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>			
          </fields>
        </register>
        <register>
          <name>OPA_KEY</name>
          <displayName>OPA_KEY</displayName>
          <description>OPA unlockkey</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OPA_KEY</name>
              <description>OPA unlockkey</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>		
            </field>		
          </fields>		
        </register>
        <register>
          <name>CMP_KEY</name>
          <displayName>CMP_KEY</displayName>
          <description>CMP unlockkey</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMP_KEY</name>
              <description>CMP unlockkey</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>		
            </field>		
          </fields>		
        </register>
        <register>
          <name>POLL_KEY</name>
          <displayName>POLL_KEY</displayName>
          <description>polling unlockkey</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>POLL_KEY</name>
              <description>polling unlockkey</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>		
            </field>		
          </fields>		
        </register>		
