ch32-rs/ch32-rs/svd/fixed/ch32l103.svd
		</registers>
	</peripheral>
    <peripheral>
      <name>BKP</name>
      <description>Backup registers</description>
      <groupName>BKP</groupName>
      <baseAddress>0x40006C00</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DATAR1</name>
          <displayName>DATAR1</displayName>
          <description>Backup data register (BKP_DR)</description>
          <addressOffset>0x4</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>D1</name>
              <description>Backup data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAR2</name>
          <displayName>DATAR2</displayName>
          <description>Backup data register (BKP_DR)</description>
          <addressOffset>0x8</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>D2</name>
              <description>Backup data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAR3</name>
          <displayName>DATAR3</displayName>
          <description>Backup data register (BKP_DR)</description>
          <addressOffset>0xC</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>D3</name>
              <description>Backup data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAR4</name>
          <displayName>DATAR4</displayName>
          <description>Backup data register (BKP_DR)</description>
          <addressOffset>0x10</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>D4</name>
              <description>Backup data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAR5</name>
          <displayName>DATAR5</displayName>
          <description>Backup data register (BKP_DR)</description>
          <addressOffset>0x14</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>D5</name>
              <description>Backup data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAR6</name>
          <displayName>DATAR6</displayName>
          <description>Backup data register (BKP_DR)</description>
          <addressOffset>0x18</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>D6</name>
              <description>Backup data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAR7</name>
          <displayName>DATAR7</displayName>
          <description>Backup data register (BKP_DR)</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>D7</name>
              <description>Backup data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAR8</name>
          <displayName>DATAR8</displayName>
          <description>Backup data register (BKP_DR)</description>
          <addressOffset>0x20</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>D8</name>
              <description>Backup data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAR9</name>
          <displayName>DATAR9</displayName>
          <description>Backup data register (BKP_DR)</description>
          <addressOffset>0x24</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>D9</name>
              <description>Backup data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAR10</name>
          <displayName>DATAR10</displayName>
          <description>Backup data register (BKP_DR)</description>
          <addressOffset>0x28</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>D10</name>
              <description>Backup data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAR11</name>
          <displayName>DATAR11</displayName>
          <description>Backup data register (BKP_DR)</description>
          <addressOffset>0x40</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>D11</name>
              <description>Backup data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAR12</name>
          <displayName>DATAR12</displayName>
          <description>Backup data register (BKP_DR)</description>
          <addressOffset>0x44</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>D12</name>
              <description>Backup data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAR13</name>
          <displayName>DATAR13</displayName>
          <description>Backup data register (BKP_DR)</description>
          <addressOffset>0x48</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>D13</name>
              <description>Backup data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OCTLR</name>
          <displayName>OCTLR</displayName>
          <description>RTC clock calibration register
          (BKP_OCTLR)</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>CAL</name>
              <description>Calibration value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>CCO</name>
              <description>Calibration Clock Output</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASOE</name>
              <description>Alarm or second output
              enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASOS</name>
              <description>Alarm or second output
              selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TPCTLR</name>
          <displayName>TPCTLR</displayName>
          <description>Backup control register
          (BKP_TPCTLR)</description>
          <addressOffset>0x30</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>TPE</name>
              <description>Tamper pin enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TPAL</name>
              <description>Tamper pin active level</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TPCSR</name>
          <displayName>TPCSR</displayName>
          <description>BKP_TPCSR control/status register
          (BKP_CSR)</description>
          <addressOffset>0x34</addressOffset>
          <size>0x10</size>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>CTE</name>
              <description>Clear Tamper event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTI</name>
              <description>Clear Tamper Interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TPIE</name>
              <description>Tamper Pin interrupt
              enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEF</name>
              <description>Tamper Event Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIF</name>
              <description>Tamper Interrupt Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
